eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_eth.h
/** @defgroup ETH_Exported_Macros ETH Exported Macros
  * @{
  */

/** @defgroup ETH_MODE ETH_MODE
  * @{
  */

#define ETH_PHY_MODE_10BaseT_Half_Duplex					(uint32_t)(0x0 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_10BaseT_Full_Duplex					(uint32_t)(0x1 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_100BaseT_Half_Duplex					(uint32_t)(0x2 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_100BaseT_Full_Duplex					(uint32_t)(0x3 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_100BaseT_Half_Duplex_With_Auto_Tuning	(uint32_t)(0x4 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_Repeater								(uint32_t)(0x5 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_Low_Consumption						(uint32_t)(0x6 << ETH_PHY_CONTROL_MODE_Pos)
#define ETH_PHY_MODE_AutoNegotiation						(uint32_t)(0x7 << ETH_PHY_CONTROL_MODE_Pos)

#define ETH_PHY_MODE_MASK									(uint32_t)(0x7 << ETH_PHY_CONTROL_MODE_Pos)

#define IS_ETH_PHY_MODE(MODE)								(((MODE) & (~ETH_PHY_MODE_MASK)) == 0)

/** @} */ /* End of group ETH_MODE */

/** @defgroup ETH_PHY_INTERFACE ETH_PHY INTERFACE
  * @{
  */
#define ETH_PHY_INTERFACE_FIBER_OPTIC						(uint32_t)(0x01 << ETH_PHY_CONTROL_FX_EN_Pos)
#define ETH_PHY_INTERFACE_ETHERNET_802_3					(uint32_t)(0x00 << ETH_PHY_CONTROL_FX_EN_Pos)

#define IS_ETH_PHY_INTERFACE(INTERFACE)						(((INTERFACE) == ETH_PHY_INTERFACE_FIBER_OPTIC) ||\
															 ((INTERFACE) == ETH_PHY_INTERFACE_ETHERNET_802_3))

/** @} */ /* End of group ETH_PHY_INTERFACE */

/** @defgroup ETH_DBG_MODE ETH_DBG_MODE
  * @{
  */

#define ETH_DBG_MODE_FREE_RUN			(uint32_t)(0x0 << ETH_G_CFGh_DBG_MODE_Pos)
#define ETH_DBG_MODE_HALT				(uint32_t)(0x2 << ETH_G_CFGh_DBG_MODE_Pos)
#define ETH_DBG_MODE_STOP				(uint32_t)(0x3 << ETH_G_CFGh_DBG_MODE_Pos)

#define IS_ETH_DBG_MODE(MODE)			((MODE == ETH_DBG_MODE_FREE_RUN) |\
										 (MODE == ETH_DBG_MODE_HALT) |\
										 (MODE == ETH_DBG_MODE_STOP))

/** @} */ /* End of group ETH_DBG_MOD */

/** @defgroup ETH_BUFFER_MODE ETH_BUFFER_MODE
  * @{
  */

#define ETH_BUFFER_MODE_LINEAR						(uint32_t) (0x0 << ETH_G_CFGl_BUFF_MODE_Pos)
#define ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS	(uint32_t) (0x1 << ETH_G_CFGl_BUFF_MODE_Pos)
#define ETH_BUFFER_MODE_FIFO						(uint32_t) (0x2 << ETH_G_CFGl_BUFF_MODE_Pos)

#define IS_ETH_BUFFER_MODE(MODE)					((MODE == ETH_BUFFER_MODE_LINEAR) |\
													 (MODE == ETH_BUFFER_MODE_AUTOMATIC_CHANGE_POINTERS) |\
													 (MODE == ETH_BUFFER_MODE_FIFO))

/** @} */ /* End of group ETH_BUFFER_MODE */

/** @defgroup ETH_TRANSMITTER_BITS_ORDER ETH_TRANSMITTER_BITS_ORDER
  * @{
  */

#define ETH_TRANSMITTER_BITS_ORDER_LSB	(uint32_t)(0 << ETH_X_CFG_MSB1st_Pos)
#define ETH_TRANSMITTER_BITS_ORDER_MSB	(uint32_t)(1 << ETH_X_CFG_MSB1st_Pos)

#define IS_ETH_TRANSMITTER_BITS_ORDER(ORDER)		((ORDER == ETH_TRANSMITTER_BITS_ORDER_LSB ) || \
													 (ORDER == ETH_TRANSMITTER_BITS_ORDER_MSB))

/** @} */ /* End of group ETH_TRANSMITTER_BITS_ORDER */

/** @defgroup ETH_TRANSMITTER_BE ETH_TRANSMITTER_BE
  * @{
  */
#define ETH_TRANSMITTER_BE_LITTLE_ENDIAN		(uint32_t)(0x0 << ETH_X_CFG_BE_Pos)
#define ETH_TRANSMITTER_BE_BIG_ENDIAN			(uint32_t)(0x1 << ETH_X_CFG_BE_Pos)

#define IS_ETH_TRANSMITTER_BE(BE)			((BE == ETH_TRANSMITTER_BE_LITTLE_ENDIAN) |\
											 (BE == ETH_TRANSMITTER_BE_BIG_ENDIAN))


/** @} */ /* End of group ETH_TRANSMITER_BE */

/** @defgroup ETH_TRANSMITTER_EVENT_MODE ETH_TRANSMITTER_EVENT_MODE
  * @{
  */

#define ETH_TRANSMITTER_EVENT_MODE_XFIFO_EMPTY			(uint32_t)(0x0 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_XFIFO_ALMOST_EMPTY	(uint32_t)(0x1 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_XFIFO_HALF_FULL		(uint32_t)(0x2 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_XFIFO_ALMOST_FULL	(uint32_t)(0x3 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_XFIFO_FULL			(uint32_t)(0x4 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_PAKET_SENT			(uint32_t)(0x5 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_READ_WORD			(uint32_t)(0x6 << ETH_X_CFG_EVNT_MODE_Pos)
#define ETH_TRANSMITTER_EVENT_MODE_START_TRANSMIT		(uint32_t)(0x7 << ETH_X_CFG_EVNT_MODE_Pos)

#define ETH_TRANSMITTER_EVENT_MODE_MASK					(uint32_t)(0x7 << ETH_X_CFG_EVNT_MODE_Pos)

#define IS_ETH_TRANSMITTER_EVENT_MODE(MODE)				((MODE & (~ETH_TRANSMITTER_EVENT_MODE_MASK)) == 0)

/** @} */ /* End of group ETH_TRANSMITTER_EVENT_MODE */

/** @defgroup ETH_RECEVIER_BE ETH_RECEVIER_BE
  * @{
  */

#define ETH_RECEIVER_BE_LITTLE_ENDIAN		(uint32_t)(0x0 << ETH_R_CFG_BE_Pos)
#define ETH_RECEIVER_BE_BIG_ENDIAN			(uint32_t)(0x1 << ETH_R_CFG_BE_Pos)

#define IS_ETH_RECEIVER_BE(BE)				((BE == ETH_RECEIVER_BE_LITTLE_ENDIAN) |\
											 (BE == ETH_RECEIVER_BE_BIG_ENDIAN))

/** @} */ /* End of group ETH_RECEVIER_BE */

/** @defgroup ETH_RECIIVER_BITS_ORDER ETH_RECIIVER_BITS_ORDER
  * @{
  */

#define ETH_RECEIVER_BITS_ORDER_LSB	(uint32_t)(0 << ETH_R_CFG_MSB1st_Pos)
#define ETH_RECEIVER_BITS_ORDER_MSB	(uint32_t)(0 << ETH_R_CFG_MSB1st_Pos)

#define IS_ETH_RECEIVER_BITS_ORDER(ORDER)		((ORDER == ETH_RECEIVER_BITS_ORDER_LSB ) || \
												 (ORDER == ETH_RECEIVER_BITS_ORDER_MSB))

/** @} */ /* End of group ETH_RECIIVER_BITS_ORDER */

/** @defgroup ETH_RECEIVER_EVENT_MODE ETH_RECEIVER_EVENT_MODE
  * @{
  */

#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_EMPTY				(uint32_t)(0x0 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_EMPTY		(uint32_t)(0x1 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_HALF_EMPTY			(uint32_t)(0x2 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_ALMOST_FULL		(uint32_t)(0x3 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_RFIFO_NOT_FULL				(uint32_t)(0x4 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_PACET_RECEIVED				(uint32_t)(0x5 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_WORD_RECEIVED				(uint32_t)(0x6 << ETH_R_CFG_EVNT_MODE_Pos)
#define ETH_RECEIVER_EVENT_MODE_PACET_DROPED				(uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)

