eldarkg/emdr1986x-std-per-lib/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_eth.h
#define ETH_RECEIVER_EVENT_MODE_MASK						(uint32_t)(0x7 << ETH_R_CFG_EVNT_MODE_Pos)

#define IS_ETH_RECEIVER_EVENT_MODE(MODE)					((MODE & (~ETH_RECEIVER_EVENT_MODE_MASK)) == 0)

/** @} */ /* End of group ETH_RECEIVER_EVENT_MODE */

/** @defgroup ETHERNET_Interrupt_defintions ETHERNET Interrupt defintions
  * @{
  */

#define ETH_MAC_IT_MII_RDY				(uint32_t)(0x00008000)
#define ETH_MAC_IT_MDIO_INT				(uint32_t)(0x00004000)
#define ETH_MAC_IT_CRS_LOST				(uint32_t)(0x00001000)
#define ETH_MAC_IT_LC					(uint32_t)(0x00000800)
#define ETH_MAC_IT_UNDF					(uint32_t)(0x00000400)
#define ETH_MAC_IT_XF_ERR				(uint32_t)(0x00000200)
#define ETH_MAC_IT_XF_OK				(uint32_t)(0x00000100)
#define ETH_MAC_IT_SF					(uint32_t)(0x00000080)
#define ETH_MAC_IT_LF					(uint32_t)(0x00000040)
#define ETH_MAC_IT_CF					(uint32_t)(0x00000020)
#define ETH_MAC_IT_CRC_ERR				(uint32_t)(0x00000010)
#define ETH_MAC_IT_SMB_ERR				(uint32_t)(0x00000008)
#define ETH_MAC_IT_OVF					(uint32_t)(0x00000004)
#define ETH_MAC_IT_MISSED_F				(uint32_t)(0x00000002)
#define ETH_MAC_IT_RF_OK				(uint32_t)(0x00000001)

#define IS_ETH_MAC_IT(IT)				(( IT & 0xFFFF2000 ) == 0)

/** @} */ /* End of group ETHERNET_Interrupt_defintions */

/** @defgroup ETHERNET_Flags ETHERNET Flags
  * @{
  */

#define ETH_MAC_FLAG_R_EMPTY				((uint32_t)0x00000001)
#define ETH_MAC_FLAG_R_AEMPTY				((uint32_t)0x00000002)
#define ETH_MAC_FLAG_R_HALF					((uint32_t)0x00000004)
#define ETH_MAC_FLAG_R_AFULL				((uint32_t)0x00000008)
#define ETH_MAC_FLAG_R_FULL					((uint32_t)0x00000010)
#define ETH_MAC_FLAG_X_EMPTY				((uint32_t)0x00000100)
#define ETH_MAC_FLAG_X_AEMPTY				((uint32_t)0x00000200)
#define ETH_MAC_FLAG_X_HALF					((uint32_t)0x00000400)
#define ETH_MAC_FLAG_X_AFULL				((uint32_t)0x00000800)
#define ETH_MAC_FLAG_X_FULL					((uint32_t)0x00001000)

#define IS_ETH_MAC_FLAG(FLAG)				((( FLAG & 0xFFFFE0E0 ) == 0) |\
											 (!(FLAG == 0)))

/** @} */ /* End of group ETHERNET_Flags */

/** @defgroup ETHERNET_Clock_Source ETHERNET Clock Source
  * @{
  */

#define ETH_PHY_CLOCK_SOURCE_HSI			(uint32_t)(0x00000000)
#define ETH_PHY_CLOCK_SOURCE_HSE			(uint32_t)(0x10000000)
#define ETH_PHY_CLOCK_SOURCE_PLLCPU_0		(uint32_t)(0x20000000)
#define ETH_PHY_CLOCK_SOURCE_HSE2			(uint32_t)(0x30000000)

#define IS_ETH_CLOCK_SOURCE(CLOCK_SOURCE)		((CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSI) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_PLLCPU_0) |\
												 (CLOCK_SOURCE == ETH_PHY_CLOCK_SOURCE_HSE2))

/** @} */ /* End of group ETHERNET_Clock_Source */

/** @defgroup ETHERNET_Clock_BRG ETHERNET Clock BRG
  * @{
  */

#define ETH_HCLKdiv1                       ((uint32_t)0x00000000)
#define ETH_HCLKdiv2                       ((uint32_t)0x00000001)
#define ETH_HCLKdiv4                       ((uint32_t)0x00000002)
#define ETH_HCLKdiv8                       ((uint32_t)0x00000003)
#define ETH_HCLKdiv16                      ((uint32_t)0x00000004)
#define ETH_HCLKdiv32                      ((uint32_t)0x00000005)
#define ETH_HCLKdiv64                      ((uint32_t)0x00000006)
#define ETH_HCLKdiv128                     ((uint32_t)0x00000007)

#define IS_ETH_CLOCK_BRG(BRG)              ((BRG) <= 7)

/** @} */ /* End of group ETHERNET_Clock_BRG */

/** @defgroup PHY_Clock_HCLKdiv PHY Clock HCLKdiv
  * @{
  */

#define ETH_PHY_HCLKdiv1                       ((uint32_t)0x00000000 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv2                       ((uint32_t)0x00000001 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv4                       ((uint32_t)0x00000002 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv8                       ((uint32_t)0x00000003 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv16                      ((uint32_t)0x00000004 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv32                      ((uint32_t)0x00000005 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv64                      ((uint32_t)0x00000006 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)
#define ETH_PHY_HCLKdiv128                     ((uint32_t)0x00000007 << RST_CLK_ETH_CLOCK_PHY_BRG_Pos)

#define IS_ETH_PHY_HCLKdiv(BRG)                (((~BRG) & 0x00070000) == 0)

/** @} */ /* End of group PHY_Clock_HCLKdiv */

/** @defgroup ETHERNET_Clock_Number ETHERNET Clock Number
  * @{
  */

#define ETH_CLK1							((uint32_t)0x01000000)
#define ETH_CLK2							((uint32_t)0x40000000)

#define IS_ETH_CLK(ETH_CLK)					((ETH_CLK == ETH_CLK1) ||\
											 (ETH_CLK == ETH_CLK2))
/** @} */ /* End of group ETHERNET_Clock_Number */

/* ETHERNET errors */
#define  ETH_ERROR              ((uint32_t)0)
#define  ETH_SUCCESS            ((uint32_t)1)

/**--------------------------------------------------------------------------**/
/**
  * @brief                     Description of common PHY registers
  */
/**--------------------------------------------------------------------------**/

/** @defgroup ETH_PHY_FLAGs ETH PHY FLAGs
  * @{
  */

#define ETH_PHY_FLAG_MDINT			((uint32_t)0x00000400)
#define ETH_PHY_FLAG_MDO			((uint32_t)0x00000200)
#define ETH_PHY_FLAG_FX_VALID		((uint32_t)0x00000100)
#define ETH_PHY_FLAG_COL			((uint32_t)0x000000C0)
#define ETH_PHY_FLAG_CRS			((uint32_t)0x00000020)
#define ETH_PHY_FLAG_READY			((uint32_t)0x00000010)
#define ETH_PHY_FLAG_FULL_DUPLEX	((uint32_t)0x00000008)
#define ETH_PHY_FLAG_CARRIER_SENSE	((uint32_t)0x00000004)
#define ETH_PHY_FLAG_LINK			((uint32_t)0x00000002)
#define ETH_PHY_FLAG_100MBIT		((uint32_t)0x00000001)

#define IS_ETH_PHY_FLAG(FLAG)		((FLAG == ETH_PHY_FLAG_MDINT) 		||\
									 (FLAG == ETH_PHY_FLAG_MDO) 		||\
									 (FLAG == ETH_PHY_FLAG_FX_VALID)	||\
									 (FLAG == ETH_PHY_FLAG_COL) 		||\
									 (FLAG == ETH_PHY_FLAG_CRS) 		||\
									 (FLAG == ETH_PHY_FLAG_READY) 		||\
									 (FLAG == ETH_PHY_FLAG_FULL_DUPLEX) ||\
									 (FLAG == ETH_PHY_FLAG_CARRIER_SENSE) ||\
									 (FLAG == ETH_PHY_FLAG_LINK) 		||\
									 (FLAG == ETH_PHY_FLAG_100MBIT))

/** @} */ /* End of group ETH_PHY_FLAGs */

/** @defgroup PHY_Read_Write_Timeouts PHY Read write Timeouts
  * @{
  */

